espressif/esp-idf/components/soc/esp32c61/include/soc/gpio_sig_map.h
/*
 * SPDX-FileCopyrightText: 2024 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#pragma once

#define EXT_ADC_START_IDX                       0
#define LEDC_LS_SIG_OUT0_IDX                    0
#define LEDC_LS_SIG_OUT1_IDX                    1
#define LEDC_LS_SIG_OUT2_IDX                    2
#define LEDC_LS_SIG_OUT3_IDX                    3
#define LEDC_LS_SIG_OUT4_IDX                    4
#define LEDC_LS_SIG_OUT5_IDX                    5
#define U0RXD_IN_IDX                            6
#define U0TXD_OUT_IDX                           6
#define U0CTS_IN_IDX                            7
#define U0RTS_OUT_IDX                           7
#define U0DSR_IN_IDX                            8
#define U0DTR_OUT_IDX                           8
#define U1RXD_IN_IDX                            9
#define U1TXD_OUT_IDX                           9
#define U1CTS_IN_IDX                            10
#define U1RTS_OUT_IDX                           10
#define U1DSR_IN_IDX                            11
#define U1DTR_OUT_IDX                           11
#define I2S_MCLK_IN_IDX                         12
#define I2S_MCLK_OUT_IDX                        12
#define I2SO_BCK_IN_IDX                         13
#define I2SO_BCK_OUT_IDX                        13
#define I2SO_WS_IN_IDX                          14
#define I2SO_WS_OUT_IDX                         14
#define I2SI_SD_IN_IDX                          15
#define I2SO_SD_OUT_IDX                         15
#define I2SI_BCK_IN_IDX                         16
#define I2SI_BCK_OUT_IDX                        16
#define I2SI_WS_IN_IDX                          17
#define I2SI_WS_OUT_IDX                         17
#define I2SO_SD1_OUT_IDX                        18
#define CPU_TESTBUS0_IDX                        19
#define CPU_TESTBUS1_IDX                        20
#define CPU_TESTBUS2_IDX                        21
#define CPU_TESTBUS3_IDX                        22
#define CPU_TESTBUS4_IDX                        23
#define CPU_TESTBUS5_IDX                        24
#define CPU_TESTBUS6_IDX                        25
#define CPU_TESTBUS7_IDX                        26
#define CPU_GPIO_IN0_IDX                        27
#define CPU_GPIO_OUT0_IDX                       27
#define CPU_GPIO_IN1_IDX                        28
#define CPU_GPIO_OUT1_IDX                       28
#define CPU_GPIO_IN2_IDX                        29
#define CPU_GPIO_OUT2_IDX                       29
#define CPU_GPIO_IN3_IDX                        30
#define CPU_GPIO_OUT3_IDX                       30
#define CPU_GPIO_IN4_IDX                        31
#define CPU_GPIO_OUT4_IDX                       31
#define CPU_GPIO_IN5_IDX                        32
#define CPU_GPIO_OUT5_IDX                       32
#define CPU_GPIO_IN6_IDX                        33
#define CPU_GPIO_OUT6_IDX                       33
#define CPU_GPIO_IN7_IDX                        34
#define CPU_GPIO_OUT7_IDX                       34
#define USB_JTAG_TDO_IDX                        35
#define USB_JTAG_TRST_IDX                       35
#define USB_JTAG_SRST_IDX                       36
#define USB_JTAG_TCK_IDX                        37
#define USB_JTAG_TMS_IDX                        38
#define USB_JTAG_TDI_IDX                        39
#define CPU_USB_JTAG_TDO_IDX                    40
#define USB_EXTPHY_VP_IDX                       41
#define USB_EXTPHY_OEN_IDX                      41
#define USB_EXTPHY_VM_IDX                       42
#define USB_EXTPHY_SPEED_IDX                    42
#define USB_EXTPHY_RCV_IDX                      43
#define USB_EXTPHY_VPO_IDX                      43
#define USB_EXTPHY_VMO_IDX                      44
#define USB_EXTPHY_SUSPND_IDX                   45
#define I2CEXT0_SCL_IN_IDX                      46
#define I2CEXT0_SCL_OUT_IDX                     46
#define I2CEXT0_SDA_IN_IDX                      47
#define I2CEXT0_SDA_OUT_IDX                     47
#define ANT_SEL0_IDX                            48
#define ANT_SEL1_IDX                            49
#define ANT_SEL2_IDX                            50
#define ANT_SEL3_IDX                            51
#define ANT_SEL4_IDX                            52
#define ANT_SEL5_IDX                            53
#define ANT_SEL6_IDX                            54
#define ANT_SEL7_IDX                            55
#define ANT_SEL8_IDX                            56
#define ANT_SEL9_IDX                            57
#define ANT_SEL10_IDX                           58
#define ANT_SEL11_IDX                           59
#define ANT_SEL12_IDX                           60
#define ANT_SEL13_IDX                           61
#define ANT_SEL14_IDX                           62
#define ANT_SEL15_IDX                           63
#define FSPICLK_IN_IDX                          64
#define FSPICLK_OUT_IDX                         64
#define FSPIQ_IN_IDX                            65
#define FSPIQ_OUT_IDX                           65
#define FSPID_IN_IDX                            66
#define FSPID_OUT_IDX                           66
#define FSPIHD_IN_IDX                           67
#define FSPIHD_OUT_IDX                          67
#define FSPIWP_IN_IDX                           68
#define FSPIWP_OUT_IDX                          68
#define FSPICS0_IN_IDX                          69
#define FSPICS0_OUT_IDX                         69
#define U2RXD_IN_IDX                            72
#define U2TXD_OUT_IDX                           72
#define U2CTS_IN_IDX                            73
#define U2RTS_OUT_IDX                           73
#define U2DSR_IN_IDX                            74
#define U2DTR_OUT_IDX                           74
#define EXTERN_PRIORITY_I_IDX                   82
#define EXTERN_PRIORITY_O_IDX                   82
#define EXTERN_ACTIVE_I_IDX                     83
#define EXTERN_ACTIVE_O_IDX                     83
#define SIG_IN_FUNC97_IDX                       97
#define SIG_IN_FUNC97_IDX                       97
#define SIG_IN_FUNC98_IDX                       98
#define SIG_IN_FUNC98_IDX                       98
#define SIG_IN_FUNC99_IDX                       99
#define SIG_IN_FUNC99_IDX                       99
#define SIG_IN_FUNC100_IDX                      100
#define SIG_IN_FUNC100_IDX                      100
#define FSPICS1_OUT_IDX                         102
#define FSPICS2_OUT_IDX                         103
#define FSPICS3_OUT_IDX                         104
#define FSPICS4_OUT_IDX                         105
#define FSPICS5_OUT_IDX                         106
#define GPIO_EVENT_MATRIX_IN0_IDX               118
#define GPIO_TASK_MATRIX_OUT0_IDX               118
#define GPIO_EVENT_MATRIX_IN1_IDX               119
#define GPIO_TASK_MATRIX_OUT1_IDX               119
#define GPIO_EVENT_MATRIX_IN2_IDX               120
#define GPIO_TASK_MATRIX_OUT2_IDX               120
#define GPIO_EVENT_MATRIX_IN3_IDX               121
#define GPIO_TASK_MATRIX_OUT3_IDX               121
#define CLK_OUT_OUT1_IDX                        126
#define CLK_OUT_OUT2_IDX                        127
#define CLK_OUT_OUT3_IDX                        128
#define MODEM_DIAG0_IDX                         129
#define MODEM_DIAG1_IDX                         130
#define MODEM_DIAG2_IDX                         131
#define MODEM_DIAG3_IDX                         132
#define MODEM_DIAG4_IDX                         133
#define MODEM_DIAG5_IDX                         134
#define MODEM_DIAG6_IDX                         135
#define MODEM_DIAG7_IDX                         136
#define MODEM_DIAG8_IDX                         137
#define MODEM_DIAG9_IDX                         138
#define MODEM_DIAG10_IDX                        139
#define MODEM_DIAG11_IDX                        140
#define MODEM_DIAG12_IDX                        141
#define MODEM_DIAG13_IDX                        142
#define MODEM_DIAG14_IDX                        143
#define MODEM_DIAG15_IDX                        144
#define MODEM_DIAG16_IDX                        145
#define MODEM_DIAG17_IDX                        146
#define MODEM_DIAG18_IDX                        147
#define MODEM_DIAG19_IDX                        148
#define MODEM_DIAG20_IDX                        149
#define MODEM_DIAG21_IDX                        150
#define MODEM_DIAG22_IDX                        151
#define MODEM_DIAG23_IDX                        152
#define MODEM_DIAG24_IDX                        153
#define MODEM_DIAG25_IDX                        154
#define MODEM_DIAG26_IDX                        155
#define MODEM_DIAG27_IDX                        156
#define MODEM_DIAG28_IDX                        157
#define MODEM_DIAG29_IDX                        158
#define MODEM_DIAG30_IDX                        159
#define MODEM_DIAG31_IDX                        160
// version date 2310090
